test/data/test-smoking.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:kron="http://kroniker.service.kihdb.silverbullet.dk/" xmlns:urn="urn:oio:medcom:chronic-dataset:1.0.0" xmlns:ns="http://rep.oio.dk/medcom.dk/xml/schemas/2011/06/20/">
    <soapenv:Header/>
    <soapenv:Body>
        <kron:UploadChronicDataset>
            <!--Optional:-->
            <urn:UploadChronicDatasetRequestMessage>
                <ns:MedComKD>
                    <ns:Borger>
                        <ns:CPR>2512484916</ns:CPR>
                        <ns:Fornavn>Nancy</ns:Fornavn>
                        <ns:Efternavn>Berggren</ns:Efternavn>
                        <ns:FoedselsDato>1948-12-25</ns:FoedselsDato>
                        <ns:Koen>K</ns:Koen>
                        <ns:Vej>Skovvejen 12</ns:Vej>
                        <ns:Postnummer>8010</ns:Postnummer>
                        <ns:By>Aarhus N</ns:By>
                        <ns:Kontakttelefon>86121824</ns:Kontakttelefon>
                        <ns:eMail>nb@meail.dk</ns:eMail>
                    </ns:Borger>
                    <ns:MonitoreringOgMaal>
                        <ns:Rygning>
                            <ns:ID>e6aced22-6de0-11e1-b0c4-0800200c9a66</ns:ID>
                            <ns:Dato>2011-02-28T10:39:00</ns:Dato>
                            <ns:AnalyseID>17166543221</ns:AnalyseID>
                            <ns:Status>
                                <ns:IUPAC>MCS88011</ns:IUPAC>
                                <ns:Analyse>Rygefrekvens</ns:Analyse>
                                <ns:Resultat>Dagligt</ns:Resultat>
                                <ns:Enhed>Uspecificeret</ns:Enhed>
                                <ns:PatientensMaal>Lejlighedsvis</ns:PatientensMaal>
                            </ns:Status>
                            <ns:PakkeAar>
                                <ns:IUPAC>MCS88024</ns:IUPAC>
                                <ns:Analyse>Rygning - Antal pakkeaar (20 cigaretter dagligt i et aar)</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>Pakkeaar</ns:Enhed>
                                <ns:PatientensMaal>0,1</ns:PatientensMaal>
                            </ns:PakkeAar>
                            <ns:UdfoertAf>Sundhedshuset, Assens</ns:UdfoertAf>
                        </ns:Rygning>
                    </ns:MonitoreringOgMaal>
                </ns:MedComKD>
            </urn:UploadChronicDatasetRequestMessage>
        </kron:UploadChronicDataset>
    </soapenv:Body>
</soapenv:Envelope>